using Newtonsoft.Json;
using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Net;
using System.Text;
using System.Threading.Tasks;

namespace Ay.Framework.DataCreaters
{
//    List<string> d = new List<string>();
//    List<string> result = AyAddress.GetAddress("辽宁", 200);
//            foreach (var item in result)
//            {
//                rid.Text += "\"" + item + "\",";
//            }
//List<string> result1 = AyAddress.GetAddress("黑龙江", 200);
//            foreach (var item in result1)
//            {
//                rid.Text += "\"" + item + "\",";
//            }
//            List<string> result2 = AyAddress.GetAddress("厦门", 200);
//            foreach (var item in result2)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result3 = AyAddress.GetAddress("淮北", 200);
//            foreach (var item in result3)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result4 = AyAddress.GetAddress("广州", 200);
//            foreach (var item in result4)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result5 = AyAddress.GetAddress("蚌埠", 200);
//            foreach (var item in result5)
//            {
//                rid.Text += "\"" + item + "\",";
//            }


//            List<string> result6 = AyAddress.GetAddress("马鞍山", 200);
//            foreach (var item in result6)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result7 = AyAddress.GetAddress("三亚", 200);
//            foreach (var item in result7)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result8 = AyAddress.GetAddress("呼和浩特", 200);
//            foreach (var item in result8)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result9 = AyAddress.GetAddress("青岛", 200);
//            foreach (var item in result9)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result10 = AyAddress.GetAddress("池州", 200);
//            foreach (var item in result10)
//            {
//                rid.Text += "\"" + item + "\",";
//            }


//            List<string> result11 = AyAddress.GetAddress("陕西", 200);
//            foreach (var item in result11)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result12 = AyAddress.GetAddress("深圳", 200);
//            foreach (var item in result12)
//            {
//                rid.Text += "\"" + item + "\",";
//            }

//            List<string> result13 = AyAddress.GetAddress("天津", 200);
//            foreach (var item in result13)
//            {
//                rid.Text += "\"" + item + "\",";
//            }
//            List<string> result14 = AyAddress.GetAddress("武汉", 200);
//            foreach (var item in result14)
//            {
//                rid.Text += "\"" + item + "\",";
//            }
    /// <summary>
    /// 地址帮助类
    /// </summary>
    public class AyAddress
    {
        public static List<string> Addresses = new List<string> { "徽州大道与紫云路交汇处东北侧 滨湖世纪城", "合肥市蜀山区黄山路与怀宁路交口东北角(艾唯精品主题酒店) 金大地·1912", "望江西路198号 信旺华府骏苑", "合肥市长丰县汲水桥西南 北城世纪城", "安徽省合肥市包河区徽州大道与烟墩路交汇处 高速滨湖时代广场", "安徽省合肥市包河区马鞍山南路88号 金地国际城", "安徽省合肥市蜀山区望江西路205号 金色名郡", "合肥市马鞍山路与万岗路交叉口南100米 万振逍遥苑", "安徽省合肥市临泉东路与王岗路交叉口东北角 恒大城", "安徽省合肥市蜀山区合作化南路16号 安粮城市广场", "合肥市包河区铜陵南路199号 蓝鼎·星河府小区", "安徽省合肥市瑶海区长江东路288号 柏庄春暖花开", "安徽省合肥市庐阳区阜阳北路与凌湖路交口东北角 融侨悦城", "安徽省合肥市肥西县海恒社区观海路南湖春城 南湖春城", "安徽省合肥市瑶海区铜陵北路与天水路交叉口 长虹世纪荣廷", "合肥市合肥市嘉山路102号 利港·银河新城", "安徽省合肥市长丰县双凤工业园区蒙城北路与金梅大道交口西南角 力高共和城", "安庆西路318号 琥珀山庄", "蒙城北路与连水路交口东南角 恒盛皇家花园", "滨湖新区滨湖新区紫云路与庐州大道交汇处西南角 蓝鼎·观湖苑", "大兴旧宫镇小红门路28号宣颐公园南侧 宣颐家园", "北京市昌平区太平庄东一路16号 天通东苑-一区", "龙禧三街 北店嘉园", "北京市朝阳区太阳星城金星园小区2号楼 金星园", "北京市朝阳区北苑路亚运村往北6公里 绣菊园", "青塔西路51号 蔚园小区", "北京市朝阳区广渠路15号(广渠路大郊亭西北角) 金茂府", "海淀上地大厦东侧,上地西里小区东门东侧 上地东里", "北京市朝阳区北四环中路6号 华亭嘉园", "航天城友谊路102号 航天城社区", "西城区陶然亭南门（二环以内） 北京清芷园小区", "北京市朝阳区望京西路50号(近望京桥) 鹿港嘉苑", "朝阳区十里堡北区一号 炫特嘉园", "黄村西路田村路202号 雍景四季", "北京市通州区景盛北一街17号 珠江逸景家园", "北京市丰台区东高地斜街2号 东高地小区", "东城区陶然亭桥东侧 中海紫御公馆", "北京市昌平区立水桥以北1.5公里处天通苑城铁附近 天通北苑(三区)", "北京市朝阳区南湖西园113号 世安家园", "西城区广安门外华联附近临近广安门外大街 远见名苑小区", "荷禹路105号 万宝城", "2号大街与5号大街交叉口 和达城", "杭州市拱墅区上塘路1050号 拱北小区", "余杭西溪湿地延伸带天目山路延伸段北侧 金成竹海水韵", "学院路159号附近 翠苑一区", "杭州市杭海路1636号 复地连城国际", "蕙兰雅路66 丁桥兰苑", "浙江省杭州市余杭区天目山西路99号(天目山西路南侧) 盛世嘉园", "杭州市拱墅区萍水街380号 万家花城", "滨文路646号 浙新小区", "浙江省杭州市滨江区春波路32号 春波小区", "钱江路158号 春江花月", "余杭区三墩-勾庄区块莫干山路延伸段以东世纪大道以南 天阳棕榈湾", "浙江省杭州市江干区下沙10号大街27号路口 野风海天城", "浙江省杭州市江干区文渊路223附近 四季广场", "浙江省杭州市西湖区方家路之江1号酩楼艺墅大酒店北 绿城之江一号小区", "浙江省杭州市江干区下沙经济开发区24号大街 保利湾天地", "杭州市江干区秋涛北路385号 濮家新村", "杭州市拱墅区湖墅南路158号 大塘新村", "文一路翠柏路11号 翠苑三区", "上海市闵行区宁虹路1101弄 爱博一村", "上海市远景路97弄33号1703室 中远两湾城", "浦东新区年家浜东路129弄(周园路) 印象春城", "花园石桥路28弄1～8号 汤臣一品", "上海市松江区沪松公路1118号 奥林匹克花园", "航东路528弄航华路45号 航华一村一街坊", "上海市静安区共和新路2420号 新梅共和城", "上海市宝山区真华路999弄3号 水岸蓝桥", "沪南公路2688弄 康桥老街", "上海市浦东新区板泉路2101弄1-64号 三林世博家园", "上海市浦东新区御衡路68弄28号201室 锦绣华都小区", "龙吴路1323弄1-28号 华滨家园", "淞南五村179-1临 淞南五村", "周浦周星路500弄22号 明天华城", "梅陇十一村96-1 梅陇十一村(罗秀路1001弄小区北)", "上海市宝山区国权北路828弄 美岸栖庭", "上海市虹口区临平北路333号(四号线临平路站) 瑞虹新城", "双桥路1139弄-1-32号 东源名都", "上海市静安区 共康四村", "上海市长宁区镇宁路465弄41号102室 镇宁路465弄小区", "迎宾路128号 华南碧桂园", "白云区白云大道北1689号 岭南新世界", "天河中山大道棠德西路56号 棠德小区", "花都区花东镇金谷北路 富力金港城", "广东省广州市增城区陈家林路 翡翠绿洲小区", "广州市海珠区宝岗大道928号 翠城花园", "广东省广州市番禺区新地路 雅居乐剑桥郡", "广东省广州市海珠区艺洲路灏景街1号 珠江帝景", "增城区新塘镇花园东路6号 新塘新世界花园", "中山大道东81号 金碧世纪花园", "广州市天河区丁香街7号 中海康城花园", "南岸路67号 荔港南湾", "骏业路8号 佳大时代公寓", "番禺洛浦街南埔环岛西路121号(洛溪南浦岛西岸) 锦绣半岛", "广东省广州市花都区镜湖大道北18号 豪利花园", "握山南一路31 广园新村", "广州市番禺区沙溪大道282号 珠江花园", "番禺区钟村祈福路大夫山森林公园北门 锦绣生态园", "天河天河区龙口西路551号 穗园小区", "广州市海珠区南洲路2014号 珠江御景湾", "海口市龙华区海垦路88号 金山小区", "海甸岛六路 海甸岛小区", "龙华区国贸玉沙路16号 富豪花园小区", "海南省海口市琼山区凤翔东路6号 绿色佳园", "海口琼山区凤翔东路2-1号 江畔人家小区", "海口市龙华区丘海大道71号 滨涯花园新村", "海南省海口市云龙镇云定路88号（海口琼山区） 南国威尼斯城", "现代花园海口市坡博路28号 现代花园小区", "海口市南海大道9号 明光国际", "海南省海口市美兰区海甸二东路69号 广物滨江海岸", "海口市琼山区国兴大道63号 盛达景都", "海南省海口市龙华区渡海路2号 恒大外滩", "海口市美兰区和平大道20号 鹏晖新天地", "海口市新埠岛国际游艇会北侧(海南之心二期北侧) 滨海国际", "海南省海口市美兰区琼山大道61号 天鹅湾", "海南省海口市琼山区大英山西三路22 八一小区", "滨江西路388号 翡翠水城", "海南市海口市海秀东路39号 申鑫国际广场", "海南省海口市美兰区桂林洋开发区兴洋大道开维生态城 开维生态城", "凤翔东路131号 凤翔山庄", "南京市栖霞区和燕路408号 晓庄国际广场", "江苏省南京市江宁区将军大道9号 托乐嘉街区", "清水亭东路9号 万科金域蓝湾", "南京市浦口区珍珠南路2号（浦口服装城旁边） 明发城市广场", "江苏省南京市建邺区友谊路38 莲花新城北苑", "江宁区将军大道20号 翠屏国际城", "江苏省南京市玄武区中央路417号 先锋广场", "江苏省南京市玄武区玄武大道88号 阳光聚宝山庄", "建邺区汉中门大街301号（清江路与集庆门大街交汇处） 苏宁睿城", "浦口浦珠路59号(浦珠北路和柳州南路交汇处) 大华锦绣华城", "孝陵卫钟灵街48号 农科院小区", "南京市建邺区金沙江东街89号 保利香槟国际", "江苏省南京市玄武区锁金村 锁金村小区", "秦虹南路52号 秦虹小区", "江宁区东山镇湖山路369号 天元吉第城小区", "江苏省南京市江宁区通淮街18号 太平花苑", "江宁区秣陵街道清水亭东路158号 恒大绿洲", "南京市秦淮区石杨路与绕城路交叉口正南 银龙花园", "北苑东路1号 月苑小区", "西善桥北路9-2号 七彩星城", "四川省成都市高新区红星路南延线 中德英伦联邦", "双流区航空港黄河路36号 圣菲TOWN城", "四川省成都市锦江区水碾河路14号 蜀都花园", "锦江锦东路568号（牛市口派出所旁） 摩根中心", "静康路中段静沙南路18号 沙河壹号", "中和二街66号 军安卫士花园", "四川省成都市高新区新会展片区盛邦街333号 中海兰庭", "四川省成都市郫都区西区大道1398号(500米绿化带旁) 华润橡树湾", "龙泉驿区东大街东延线龙城大道1号(航天立交原大观立交外约6公里处) 龙城1号", "青羊区青羊大道8号 成都花园", "西华大道608号 府河星城", "锦江区大慈寺路3号 朗御", "四川省成都市郫都区红高路88号 龙城国际", "四川省成都市龙泉驿区银河路118号 恒大绿洲", "府青路三段 浅水半岛", "成华昭觉寺南路东丽街138号 金科一城", "金牛区新泉路33号 兴元绿洲", "翠柳湾支路199 蓝光凯丽香江", "四川省成都市龙泉驿区大面镇龙城大道9号(四川师范大学新校区内) 师大现代花园", "锦江佳宏路200号（东大街东延线与川师北街交汇处） 比华利国际城", "石杨路266号 春风与湖", "重庆市南岸区南滨路泰昌路69号(法国水师兵营旁) 长嘉汇", "重庆市江北区北滨一路258号 龙湖·春森彼岸", "重庆市渝中区石油路 协信阿卡迪亚", "重庆市江北区建新西路52号 华宇·北国风光小区", "北部新区经开区北区翠渝路55号(金开大道和金兴大道交界处) 首钢美利山公园城市", "重庆市渝北区渝鲁大道188号(渝鲁大道与海尔路交汇处) 庆业九寨印象小区", "重庆南岸区天文大道1号（南岸新行政中心后面） 鲁能领秀城", "重庆市南岸区南滨西路28号(兰花路社区公园旁) 恒基·翔龙江畔", "北部新区金渝大道56号(经开区管委会旁) 爱加西西里", "北部新区人和白桦路6号(重庆市消防总队对面) 万科缇香郡", "北部新区高新园金山大道1号(金开大道和金山大道交汇处) 恒大华府", "重庆市江北区五桂路新区政府旁 金科廊桥水岸", "重庆市南岸区金山支路6号 南坪四小区", "重庆市渝北区湖云街1号 绿土翠古小区", "江北区华新村96号 光华观府国际", "重庆市渝北区金渝大道88号 叠彩城", "重庆市沙坪坝区沙滨路66号 华宇秋水长天", "渝北龙塔街兴盛大道2号(龙头寺公交车站旁) 中渝梧桐郡", "重庆渝北宝圣大道599号(西南政法大学旁) 金鹏两江时光小区", "安徽省六安市裕安区帝都豪园(磨子潭路西) 帝都豪园", "安徽省六安市裕安区解放南路与佛子岭路交叉口 和顺·名都城", "安徽省六安市裕安区永安小区(将军路西) 永安小区", "安徽省六安市金安区一品尚都14号楼 一品尚都", "皖西大道红叶大厦 红叶花园小区", "安徽省六安市金安区中市街道皖西大道六州首府 六州首府", "六安市裕安区豪门花园2期 富安新城", "南屏路与东望路交叉口 南屏苑", "安徽省六安市裕安区淠河中路天南汽修西200米 华邦新华城", "裕安区六安市二水厂东 振兴中央公馆", "安徽省六安市金安区望城街道淠望路龙湖天地 高速龙湖天地", "六安市皖西大道与正阳路交汇处 远大幸福里", "六安市大别山路39号 滨河御景", "安徽省六安市裕安区佛子岭中路 中辰一品", "六安市解放北路(汽车北站西南侧) 万兴明月港湾", "安徽省六安市金安区长安路与梅山北路东北角 淠绿新村", "龙河路与平桥路交汇处 平安·怡景园", "解放北路三里桥 华安未来城", "六安市六安市人民路93号 青年广场小区", "安徽省六安市淠河路和光明路交叉口(原老啤酒厂) 御龙湾小区", "河北省石家庄市栾城区阳光大道 卓达太阳城", "长安中山东路与谈固南大街交口东北角 谈固国瑞城", "河北省石家庄市鹿泉区龙泉东路160号 果岭湾", "中华北大街370号 北郡小区", "河北省石家庄市桥西区红旗大街与建国路交叉口西行100米路北 翰林观天下小区", "栾城区其他珠江大道与珠峰大街交口西北角 天山水榭花都", "高新开发区珠峰大街180号(与湘江道交口西南角) 珠峰国际花园", "河北省石家庄市长安区平安北大街67号 中基·礼域尚城", "裕华区祁连大街122号(东仰陵村北) 天然城", "河北省石家庄市长安区北二环东路68号 亚龙花园小区", "高营镇建华北大街398 亲亲小镇(ABCD区)", "塔南路195号 卓达·书香园", "友谊北大街456 天苑生活小区", "鹿泉区红旗南大街与永壁北街口西行500米 安联青年城", "建华南大街与塔北路交叉口西北角 天海誉天下", "裕华区体育南大街409号 南岭小区", "裕华东岗路75号 世纪花园小区", "河北省石家庄市长安区方北路58号 剑桥春雨小区", "珠江大道88号 长九中心", "联盟西路333号 联强生活小区", "安徽省亳州市谯城区杜仲路与西一环交汇处 恒大城", "毫州市谯城区汤王大道与牡丹路交叉口（毫州师专正对面） 建投·世纪城", "安徽省亳州市涡阳县乐行路 巨人印象", "谯城区亳州市南部新区汤王大道与菊花路交汇处西北角 建投南湖春城", "安徽省亳州市蒙城县永兴路 蒙城永兴小区", "亳州市谯城区养生大道 观澜天下", "光明西路319号 富荣花园", "经济技术开发区人民医院南院向西200米 亳州一品居", "安徽省亳州市谯城区桐乡路 桃花源小区", "汤王大道 天润花园小区", "亳州市谯城区汤王大道827号 帝景华庭小区", "亳州市蒙城县地矿大道92号 许疃矿工人村", "亳州市谯城区希夷大道 学府家园", "向阳路143号 奥林清华小区", "安徽省亳州市谯城区光明路与汤王大道交叉口 御花园", "交通路 木兰小区", "045乡道旁边 芍花小区", "安徽省亳州市蒙城县庄周街道濮水路五里河路西150米 十里小区", "安徽省亳州市谯城区芍花路与三曹路交口(曹操公园南大门正对面) 广齐城市广场", "经济技术开发区南门桐花路 中瑞国际花园", "霸州市大广高速392号 霸州温泉新都孔雀城", "廊坊市广阳区北凤道9号 华夏奥韵", "京哈高速（顺达商标彩印包装厂向东550米） 荣盛白鹭岛", "燕郊开发区燕顺路原枣林村 上上城青年新城", "廊坊市大厂回族自治县滨河大道 孔雀城英国宫", "学院东大街1号 北欧小镇小区", "高新技术开发区思菩兰西路艺术中心 港中旅海泉湾", "迎宾大道与西外环交叉口北侧 江南水郡", "河北省廊坊市大厂回族自治县厂通路与滨河大道交汇处东北角 潮白河孔雀城英国宫1期", "廊坊市安次区爱民西道 馨视界", "河北省廊坊市安次区恒康节与荣开街西南交汇处 华夏第九园", "河北省廊坊市广阳区和平路与新源道交口 城市旺点小区", "凤鸣道与橙桔路交叉口西100米 华为公寓", "河北省廊坊市广阳区裕华路143号 华夏经典", "燕郊经济技术开发区夏威夷南岸上上村二季普纳 普纳威美亚公寓", "五一路7号 天琴湾", "银河北路128号 华苑小区", "廊坊市广阳区新源道173号 蓝水湾小区", "河北省廊坊市广阳区广阳道205号 锦绣花苑", "廊坊市三河市燕顺路1062号 世纪名苑", "厦门市思明区环岛东路1801号 中航紫金广场", "福建省厦门市海沧区海沧大道 未来海岸", "五缘湾大桥西侧环岛路旁,五缘西三里 新景国际外滩", "厦门市同安区 海上五月花", "厦门市思明区塔埔西路85号 水晶国际", "半屏山路1288号附近 塔埔社区", "洪莲北二路816号 万科·金域蓝湾", "厦门市思明区塔埔西街77号 鑫塔水尚", "演武路思明南路422号厦门大学 厦大西村小区", "福建省厦门市翔安区锦绣祥安(舫阳北路西) 锦绣祥安", "园山北里60～85 雪梨星光", "厦门市湖里区悦华路186号 马垅社小区", "福建省厦门市湖里区后埔东里97号 太微花园", "沧湖东一里512-541号 天心岛", "祥吴一里1-10 美地雅登祥吴一里", "福建省厦门市思明区谊爱路107号 禾丰新景", "滨湖南路1-60号(兴港路东侧、滨湖南路北侧) 天湖城·天湖", "枋湖片区枋湖东路370-390号 书香佳缘", "五缘东二里17号 国贸蓝海", "福建省厦门市思明区前村埔路571号302室 家家海景", "淮北市濉溪县恒大名都东门 恒大名都", "淮北市相山区相山中路188号 仁和小区", "相山路人民路302号 温哥华城", "长山中路19号 万马相山庭院", "淮北市相山区南黎路125号 锦绣和庄", "相山路303号 帝景翰园", "安徽省淮北市濉溪县濉溪镇闸河路九点阳光 九点阳光", "梅苑路15号 华佳梅苑", "淮北淮海东路35 龙溪水岸", "泉山路65 湖畔御景", "淮北市相山区桂苑路46号 深蓝华庭", "淮北市人民路与濉溪路交叉口西侧 恒大雅苑", "安徽省淮北市相山区淮海东路29号 滨湖新城", "濉溪路306号 家天下", "安徽省淮北市濉溪县经济开发区玉兰大道5号 玉兰花城", "惠苑路91号 大华新家园", "安徽省淮北市相山区南湖路58号 淮北山水文园", "人民中路239 慢城花园", "淮北市相山区南黎路121号 万福家园", "安徽省淮北市相山区三堤口街道人民路121号 巴黎印象", "广州市黄埔区峻福路56号 科城山庄", "广东省广州市增城区永顺大道东15号 海伦春天", "金沙洲滨江公园旁 中粮万科金域蓝湾", "黄埔区广汕公路南侧开创大道东侧 万科新里程", "白云区白云大道北同泰路 颐和山庄", "白云区  金沙洲沿江南段 恒大绿洲", "广东省广州市海珠区赤岗大塘聚德路13-15号 聚德花苑", "广州市番禺区大石街景华南路30号(即南大路礼村段) 新月明珠花园", "广东省广州市番禺区傍雁路883 东湖洲花园", "广州市天河区区华明路4号 星汇云锦", "增城新塘镇荔新十二路98号（瑶田路段） 顺欣花园", "广州市越秀区环市东路339号 广东国际大厦", "白云大道华南北路(尖彭路)白云堡立交掉头往南前行约200米至加油站右转 金碧雅苑", "广州市白云区西槎路1263号 阳光花园", "海珠区 宝岗大道160号 南北广场", "海珠区赤岗北路18号 泓景花园", "广州市增城区江府大道2号 东江首府", "广州市天河区宝翠路4-6号(华南植物园对面) 宝翠园", "广州市白云区解放北路1000号 金桂园", "广州市天河区天寿路105号;广州市天河区沾益直街2号 天寿大厦", "蚌埠市蚌山区涂山东路1399号 万方水晶城", "龙子湖区曹凌路997号 龙湖香都", "纬四路与红旗一路交叉口（原蚌埠玻璃厂） 柏庄春暖花开", "经济开发区蚌埠市胜利东路1556号 百合公馆", "禹会区朝阳路与东海大道交叉口(光彩大市场西侧) 荣盛锦绣香堤", "荆山路420号 琥珀花园", "荆山路552号 金奥华府", "安徽省蚌埠市禹会区朝阳路679号 观澜御湖世家", "蚌山区西岸,东海大道北侧,兰陵路与环湖西路交汇处 天湖国际", "安徽省蚌埠市蚌山区兴业街300号 蓝天花园", "安徽省蚌埠市龙子湖区望湖路568 蚌埠市龙湖嘉园小区", "蚌埠市淮上区朝阳北路1200号 丽景天成", "安徽省蚌埠市龙子湖区凤阳东路383号 东方明珠", "兴业街888 沁雅锦绣城", "安徽省蚌埠市龙子湖区南湖路54号 南湖小区", "安徽省蚌埠市蚌山区荆山路1265号 沁雅凯旋城", "安徽省蚌埠市禹会区东海大道锦江大酒店对面 万福君临天下", "胜利街道涂山东路1899号 财富广场", "蚌山区蚌埠市胜利东路1212号 龙湖红叶山庄", "蚌埠市禹会区燕山路2369号 山香家园", "湖南东路2988号 金色新天地", "马鞍山市当涂县姑孰路1135号 襄河湾", "江东大道19号 西湖花园", "江东大道北段818号 汇成上东", "马鞍山市雨山区太白大道2999号 深业华府", "开发区湖东南路198号 凡尔赛公馆", "花山工业园林里路118号 金瑞新城小区", "马鞍山市花山区霍里山大道 安粮城市广场", "马鞍山市花山区花雨路8号 中央花园", "马鞍山市花山区拉菲公馆2单元3栋1303 东方城", "马鞍山市当涂县姑孰北路1000号 君盛桃源", "向山镇马向路666号御景园 御景园", "安徽省马鞍山市雨山区银塘镇金山东路金山嘉苑 金山嘉苑", "安徽省马鞍山市雨山区西塘路166 天泽水岸", "雨山区经济开发区湖东南路 晨光花园", "安徽省马鞍山市雨山区佳山乡江东大道中段格林春天 格林春天", "安徽省马鞍山市花山区葛羊路中段(市中心医院东300米) 绿洲花园(小区)", "雨山江东大道与九华路口 江南御花园", "花园路 微山花园", "雨山东路666 朝辉首府", "迎宾路404号 东岸假日小区", "迎宾路222 迎宾花园", "三亚市天涯区 鲁能三亚湾", "海南省三亚市三亚湾路 兰海花园二期听涛阁", "海南省三亚市天涯区鲁能·三亚湾美丽五区(海虹路东) 鲁能三亚湾美丽五区", "三亚市三亚市吉阳区海韵路19号 金陵海景花园", "海南省三亚市河东区迎宾路165号(迎宾路与凤凰路交汇处附近) 中铁子悦薹", "三亚湾路114号 绿海田园", "三亚市凤凰路157号华庭天下（河东路与凤凰路交汇处） 华庭天下", "三亚市迎宾路345号 同心家园-一期", "榆亚路115号 大东海花园", "吉阳区凤凰路美丽之冠北侧300米 汇丰国际公寓", "三亚市凤凰路38号(免税店以北200米) 京海成·鹿港溪山", "二二三国道海棠花幼儿园斜对面 龙海风情小镇", "海南省三亚市吉阳区金鸡岭路438号 三亚海岳半岛成邦", "海南省三亚市吉阳区春光路21号 丽冠雅居", "荔枝沟路8号 怡和豪庭", "迎宾路中段右转高园河路东侧 湖光山舍", "三亚市凤凰路北侧妙林田洋(凯丰大酒店对面) 华庭·时光里", "三亚市二二三国道 福瑞国际公馆", "内蒙古自治区呼和浩特市赛罕区如意开发区东二环五纬路附近 讨号板村", "玉泉鄂尔多斯大街与云中路交汇南500米路西 西岸国际", "鄂尔多斯大街与丰州路交汇处 竹园小区", "新城赛马场北路,距北郊公园400米 城市维也纳", "赛罕区大学东街与丰州南路交叉口东 巨华·巨海城1区", "呼和浩特市赛罕区展览馆西路1号 长乐湾住宅小区", "东二环路曙光中学对面（乌兰恰特大剧院北500米） 首府观邸", "内蒙古自治区呼和浩特市新城区长海巷3号 长城住宅小区", "内蒙古自治区呼和浩特市赛罕区银河南街 荷塘月色", "新华东街78号（艺校对面农发银行东50米） 华门世家", "巴彦淖尔街与县府街西口交汇处 艾博龙园小区", "内蒙古自治区呼和浩特市新城区新华大街1号 世贸晶钻", "呼和浩特市新城区海拉尔大街35号 凤凰新城", "呼和浩特市赛罕区东影南路10 乌兰小区", "呼和浩特市新城区海拉尔东街辅路 联建小区", "呼和浩特市回民区阿拉善南路18号 欧星香槟美景小区", "内蒙古自治区呼和浩特市新城区海拉尔东路5号人和小区对面 开天花园小区", "毫沁营镇成吉思汗东街 鸿盛生活园区", "水上公园原仕奇公园北 奈伦城市亮点", "内蒙古自治区呼和浩特市新城区北二环路 上东墅", "山东省青岛市李沧区九水东路191号 山河城", "山东省青岛市市北区绥宁路17号 鲁岳梦境江南", "山东省青岛市市北区银川西路以北劲松三路以东 浮山后六小区", "青岛市市南区旌德路26号 颐中·高山小区", "山东省青岛市市南区银川西路7号 中海银海一号", "奥帆基地百丽广场商圈香港中路20号 福泰广场", "青岛市市北区清江路1号 鸿仕雅居", "三零八国道2648 万福山庄", "劲松七路228号 城建竹韵山色", "山东省青岛市黄岛区富春江路1076号 盛世江山", "青岛市黄岛区齐长城路1208号 昆仑山庄", "台柳路601号(青岛啤酒二厂对面、张村河北岸、紧邻河东站地铁口) 东城水岸小区", "长江中路95号 丁家河小区", "台柳路637号 河南庄小区", "同德路82号 夹岭沟小区", "东海东路1号 海信麦岛金岸", "山东省青岛市市北区兴德路96号 宜昌馨苑", "黄岛区珠山路以西,滨海二路以北的风河南岸 山水新城", "黑龙江中路3184号（虎山东麓） 青山绿水", "青岛经济技术开发区开发区江山南路123号 江山瑞城", "安徽省池州市贵池区火车站站前区齐山大道西侧 池州碧桂园", "池州市贵池区清风西路69号 和泰星城", "池州市贵池区梅林路 迎宾花园", "安徽省池州市贵池区新城明珠小区东门 新城明珠小区", "安徽省池州市贵池区杏花村街道孔井白洋路铜冠·三江明珠 铜冠三江明珠", "池州市贵池区建设西路776 书香名邸", "池州市贵池区长江中路159号 秋浦花园", "清风东路799 森桥·印象", "安徽省池州市贵池区人民路翠微苑小区童欣幼儿园附近 翠微苑小区", "长江南路388 红森国际大厦", "安徽省池州市贵池区清风街道九华大道与百牙路交汇处 河滨花园", "安徽省池州市贵池区虎泉路388号 凤凰城", "池州市经济技术开发区金溪路99号（平天湖广场对面） 志城江山郡", "西北外环与杜坞路交叉口 杏花江南小区", "安徽省池州市贵池区江口街道牧之路锦绣苑 锦绣苑", "池州市贵池区长江北路408号 春江花园", "贵池区南阳路289号 英伦城邦", "青阳北路与石台路交叉口 樟树湾", "贵池区池州九华山大道与齐山大道交汇处 池州香港城", "翠柏路以西、胜利路以北 城北花园", " 西安市", " 渭南市", " 咸阳市", " 榆林市", " 宝鸡市", " 延安市", " 汉中市", " 安康市", " 铜川市", " 商洛市", "广东省深圳市宝安区汇江二路 桃源居", "广东省深圳市龙岗区布吉新区坂田雅园路万科第五园第五园(南区) 万科第五园", "深圳市龙岗区清辉路149号 中海康城花园", "广东省深圳市龙军花园 龙军花园", "广东省深圳市南山区前海路1085号 鼎太风华小区", "广东省深圳市宝安区新安一路20 金泓凯旋城", "宝荷大道81 振业峦山谷", "深云路28 深云村", "笋岗东路2008 嘉宝田花园", "深圳市福田区莲花路1096号 彩田村", "福强路3004号 中港城", "广东省深圳市南山区西丽龙珠大道珠光村(珠光·花半里北) 珠光村", "前进二路100号 丽景城", "东滨路4343 城市山林", "广东省深圳市南山南光路与滨海大道交汇处 桂庙", "广东省深圳市宝安区兴业路3005-34 泰华阳光海", "广东省深圳市龙岗区布吉长龙路120号 阳光花园", "深圳市南山区南海大道1090号city花园城F1 City花园城", "广东省深圳市龙华区 弓村", "桃园路288号 前海花园", "解放南路与珠江道交口 名都新园", "河西古海道和南北大街交口东南侧 天津湾海景雅苑", "华龙道与新开路交口 月光园", "天津市东丽区昆仑路与津滨大道交口,津昆桥附近 铁城公寓", "天津经济技术开发区时尚西路19号 万通新城国际小区", "华苑路10号附近 绮华里", "天津市西青区大寺龙顺园小区(泽润路南140米) 龙顺园小区", "广开四马路与西市大街交口 凯兴天宝公寓", "八纬路125号 长城公寓小区", "河东区卫国道与顺航路交口 万东花园", "湘潭道38号 水竹花园", "南昌路68号附近 三义大厦小区", "天津市南开区华苑雅士道与华苑路交口 天华里教师村", "雍阳西道 北岸尚城", "天津市河西区黑牛城道193号 博兰苑", "天津市河北区缤纷路604号 嘉畅园", "天津市滨海新区中天大道2377号 美林园", "天津市滨海新区福州道942号 贻成奥林花园", "天津市南开区东马路138号 新安花园", "天津市南开区红旗路218号 桂荷园"};
        #region 私有变量

        private static string[] Querys = new string[] { "小区", "大厦" };    //可自行追加

        #endregion

        #region 私有函数

        #region 随机函数

        /// <summary>
        /// 取一个数值区间的随机数
        /// </summary>
        /// <param name="start">开始区间</param>
        /// <param name="end">结束区间</param>
        /// <returns></returns>
        private static int RandomNum(int start, int end)
        {
            Random rd = new Random();
            return rd.Next(start, end);
        }


        #endregion

        #region 调用百度接口
        /// <summary>
        /// 获取百度接口调用结果json字符串
        /// </summary>
        /// <param name="tag"></param>
        /// <param name="count">每次最多20条（百度API接口要求）</param>
        /// <returns></returns>
        private static string GetBaiDuMapApiResult(string tag,int count)
        {
            string html = string.Empty;
            string ak = "MLrSlgdxGi6DD9k8VfI4CNQ5vhYIzc7g"; //目前由个人账号申请，每天可调2000次，使用时请注意换掉
            string url = string.Format("http://api.map.baidu.com/place/v2/search?q={0}&region={1}&output=json&ak={2}&page_num={3}&page_size={4}",
                GetQueryStrRandom(),
                tag, ak, RandomNum(0, 400/count), //每次默认会搜出400条记录
                count);
            try
            {
                HttpWebRequest request = (HttpWebRequest)WebRequest.Create(url);
                request.Method = "GET";

                Encoding encoding = Encoding.UTF8;//根据网站的编码自定义    
                HttpWebResponse response = (HttpWebResponse)request.GetResponse();
                Stream responseStream = response.GetResponseStream();

                StreamReader streamReader = new StreamReader(responseStream, encoding);
                string retString = streamReader.ReadToEnd();

                streamReader.Close();
                responseStream.Close();

                return retString;
            }
            catch (WebException ex)
            {
                throw new Exception(ex.Message);
            }
        }


        /// <summary>
        /// 随机产生一个调用百度地图的查询条件
        /// </summary>
        /// <returns></returns>
        private static string GetQueryStrRandom()
        {
            int randomNum = RandomNum(0, Querys.Length - 1);
            return Querys[randomNum];
        }
        #endregion

        #endregion

        #region 公开函数
        /// <summary>
        /// 获取产生的具体地址
        /// </summary>
        /// <param name="city">城市中文名：成都</param>
        /// <param name="count">数量：最多20条</param>
        /// <returns></returns>
        public static List<string> GetAddress(string city,int count)
        {
            List<string> result = new List<string>();
            string a = GetBaiDuMapApiResult(city,count);
            ResultJsonData jo = (ResultJsonData)JsonConvert.DeserializeObject<ResultJsonData>(a);
            if (jo == null || jo.results == null || jo.results.Count < 1)
            {
                return result;
            }
            foreach (var item in jo.results)
            { 
                result.Add(item.address + " " + item.name);
            }
            return result;
        }
        /// <summary>
        /// AY
        /// 2017-11-28 11:16:14
        /// 获得地址
        /// </summary>
        /// <returns>随机从本地 数据中 获得数据</returns>
        public static string Address()
        {
            int len = Addresses.Count;
            string smallAddress = Addresses[FakerRandom.Rand.Next(len)];
            return smallAddress;
        }

        #endregion
    }
}
